// pages/about/about.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    compName: '武汉番茄时代科技有限公司',
    compMemos: [
      '感谢您使用我们的“番茄管家”您在使用过程中有任何问题可以发送到我们的邮箱欢迎提出宝贵的意见！',
      '关注我们的微信公众号：番茄管家TA（或搜索“fqgj520”）',
      '邮箱：21131244@sina.com'
    ],
    compEnDesp: {
      title: '公司简介',
      desp: '武汉番茄时代科技股份有限公司，是一家具有知名学院背景的互联网企业，专注于移动电商微商财务管理软件研发和行业生态圈服务发展的创新型企业。番茄时代创始人兼CEO徐祺先生，于2014年英国毕业回国，攻读管理学博士学位。同年带领一群海龟博士团队深入研究移动电商微商群体，4年多深入行业亲身经历，从微商小白发展成为万人团队长，看到一个个草根创业者，由小到大艰难发展过程，发现了制约微商创业者发展的痛点和需求，带着强烈的责任感与使命感，经过团队近3年的研发，于2018年正式推出全渠道与财务管理系统《番茄管家》APP，希望运用国内外先进的管理知识结合互联网科技为一体，为各大，中，小行业，品牌，商家提便携记账，进销存，客户管理等服务解决方案。助力微商移动电商行业快速发展。'
    }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})